String LineString(String? subwayId) {
  Map<String, String> subwayLineStrings ={
    '1001': '1호선', // 1호선
    '1002': '2호선', // 2호선
    '1003': '3호선', // 3호선
    '1004': '4호선', // 4호선
    '1005': '5호선', // 5호선
    '1006': '6호선', // 6호선
    '1007': '7호선', // 7호선
    '1008': '8호선', // 8호선
    '1009': '9호선', // 9호선
    '1061': '중앙선', // 중앙선
    '1063': '경의중앙', // 경의중앙
    '1065': '공항철도', // 공항철도
    '1067': '경춘선', // 경춘선
    '1075': '수인분당', // 수인분당
    '1077': '신분당', // 신분당
    '1077': '우이신설', // 우이신설
  };
  return subwayLineStrings[subwayId] ?? '';
}